#include <stdio.h>
#include <math.h>
//完全平方指用一个整数乘以自己例如1 * 1，2 * 2，3 * 3等，依此类推。
//若一个数能表示成某个整数的平方的形式，则称这个数为完全平方数。
//完全平方数是非负数，而一个完全平方数的项有两个
//四位数中的完全平方数只有88*88 = 7744
int main()
{
	//法一：
	for (int i = 1; i < 10; i++)
	{
		for (size_t j = 0; j < 10; j++)
		{
			int n = i * 1100 + j * 11;//输出1100,1122,1133,1144,1155,1166,1177,1188,1199,2200......
			int m = floor(sqrt(n) + 0.5);//判断该数开根号是否为整数 +0.5的目的是为了 减小误差的影响（浮点数丢弃小数）
			if (m*m == n)
			{
				printf("%d\n", n);
			}
		}

	}
	//法二：
	for (size_t k = 0; ; k++)
	{
		int a = k*k;
		if (a<1000)
		{
			continue;
		}
		if (a>9999)
		{
			break;
		}
		int b = a / 100;
		int c = a % 100;
		if (b / 10 == b % 10 && c / 10 == c % 10)
		{
			printf("%d\n", a);
		}
	}
	getchar();
	return 0;
}
